---
kind: method
id: M:Autodesk.Revit.DB.DWGImportOptions.#ctor(Autodesk.Revit.DB.DWGImportOptions)
source: html/3682e98b-b9f5-0110-0951-9a6cc403b351.htm
---
# Autodesk.Revit.DB.DWGImportOptions.#ctor Method

Constructs a new instance of DWGImportOptions as a copy of the import options.

## Syntax (C#)
```csharp
public DWGImportOptions(
	DWGImportOptions option
)
```

## Parameters
- **option** (`Autodesk.Revit.DB.DWGImportOptions`) - The options to be copied.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null